fitness/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])

    @comment = @post.comments.create(comment_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('mad man', 'maaan, this good yo', 2, '2017-05-13 17:41:46', '2017-05-13 17:41:46')