app/views/main_exercises/show.html.haml

SELECT "directions".* FROM "directions" WHERE "directions"."main_exercise_id" = ?  [["main_exercise_id", 11]]
---
        %ul
          - @exercise.directions.each do |direction|