app/views/posts/index.html.erb

      <% @count = 0 %>
      <% post.comments.each do %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1