app/controllers/main_exercises_controller.rb

  def index
    @exercise = MainExercise.all.order("created_at DESC")
---
SELECT "main_exercises".* FROM "main_exercises" ORDER BY created_at DESC

  def create
    @exercise = MainExercise.new(exercise_params)

    if @exercise.save
---
INSERT INTO "main_exercises" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "we"], ["description", "fes"], ["created_at", "2017-05-16 20:42:19.997141"], ["updated_at", "2017-05-16 20:42:19.997141"]]

  def update
    if @exercise.update(exercise_params)
---
UPDATE "main_exercises" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "main_exercises"."id" = ?  [["image_file_name", "20150718_204737.jpg"], ["image_file_size", 6133011], ["image_updated_at", "2017-05-17 14:37:26.764614"], ["updated_at", "2017-05-17 14:37:27.276419"], ["id", 3]]

  def destroy
    @exercise = MainExercise.find(params[:id])
    @exercise.destroy
---
SELECT  "main_exercises".* FROM "main_exercises" WHERE "main_exercises"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "main_exercises" WHERE "main_exercises"."id" = ?  [["id", 2]]

  def find_exercise
    @exercise = MainExercise.find(params[:id])
---
SELECT  "main_exercises".* FROM "main_exercises" WHERE "main_exercises"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]