app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 10], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "name"], ["address", "address"], ["email", "something@email.com"], ["pay_type", "Check"], ["created_at", 2017-05-20 18:49:28 UTC], ["updated_at", 2017-05-20 18:49:28 UTC]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 20]]