app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "How do I lose weight?"], ["description", "I want to lose 5 kgs"], ["user_id", 1], ["created_at", "2017-05-15 18:34:11.534576"], ["updated_at", "2017-05-15 18:34:11.534576"]]
---
  def create
    @post = Post.new(post_params)
    if user_signed_in?
      current_user
    end
    respond_to do |format|
      if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 4
---
  def destroy
    authenticate_user!
    if @post.user_id == current_user.id
      @post.destroy