app/controllers/workouts_controller.rb

  def index
    @workouts = Workout.all.order("created_at DESC")
---
SELECT "workouts".* FROM "workouts" ORDER BY created_at DESC

  def create
    @workout = Workout.new(workout_params)
    if @workout.save
---
INSERT INTO "workouts" ("date", "workout", "mood", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2017-05-15 18:39:00"], ["workout", "back and biceps"], ["mood", "good"], ["length", "2 hours"], ["created_at", "2017-05-15 18:39:42.244479"], ["updated_at", "2017-05-15 18:39:42.244479"]]

  def update
    if @workout.update(workout_params)
---
UPDATE "workouts" SET "workout" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["workout", "back and triceps"], ["updated_at", "2017-05-16 12:28:27.073013"], ["id", 2]]

  def destroy
    @workout.destroy
---
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 2]]

  def find_workout
    @workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]